char_map_str = """
T 0
H 1
Ô 2
N 3
G 4
<SPACE> 5
Ư 6
B 7
A 8
M 9
Ộ 10
I 11
K 12
C 13
Ũ 14
Í 15
Ơ 16
L 17
Á 18
Ạ 19
Ả 20
Y 21
X 22
Â 23
D 24
Ự 25
Ớ 26
Ứ 27
À 28
Ố 29
Ă 30
Ì 31
Ó 32
Ữ 33
U 34
Đ 35
Ú 36
Ý 37
S 38
Ế 39
R 40
Ề 41
Ò 42
Q 43
Ồ 44
Ổ 45
Ợ 46
P 47
V 48
Ẫ 49
Ặ 50
O 51
Ệ 52
Ị 53
E 54
Ậ 55
Ằ 56
Ở 57
Ụ 58
Ủ 59
Ừ 60
Ấ 61
Ã 62
Ờ 63
É 64
Ẽ 65
Ầ 66
Ê 67
Ể 68
Ọ 69
Ỡ 70
Ỏ 71
Ẩ 72
Ễ 73
Ắ 74
Ẳ 75
Ử 76
Ù 77
Õ 78
Ỷ 79
Ỉ 80
Ỳ 81
Ỹ 82
Ẻ 83
Ĩ 84
F 85
J 86
Ỗ 87
Ẵ 88
È 89
Ẹ 90
W 91
Z 92
Ỵ 93
"""
char_map = {}
index_map = {}
for line in char_map_str.strip().split('\n'):
    ch, index = line.split()
    char_map[ch] = int(index)
    index_map[int(index)] = ch
index_map[5] = ' '


# print(char_map)
# print(index_map)
# print(len(index_map))
# Result
# {"'": 1, '<SPACE>': 2, 'a': 3, 'b': 4, 'c': 5, 'd': 6, 'e': 7, 'f': 8, 'g': 9, 'h': 10, 'i': 11, 'j': 12, 'k': 13, 'l': 14, 'm': 15, 'n': 16, 'o': 17, 'p': 18, 'q': 19, 'r': 20, 's': 21, 't': 22, 'u': 23, 'v': 24, 'w': 25, 'x': 26, 'y': 27, 'z': 28}
# {1: "'", 2: ' ', 3: 'a', 4: 'b', 5: 'c', 6: 'd', 7: 'e', 8: 'f', 9: 'g', 10: 'h', 11: 'i', 12: 'j', 13: 'k', 14: 'l', 15: 'm', 16: 'n', 17: 'o', 18: 'p', 19: 'q', 20: 'r', 21: 's', 22: 't', 23: 'u', 24: 'v', 25: 'w', 26: 'x', 27: 'y', 28: 'z'}